app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.all_ratings
    if !session.has_key?(:ratings) #check if there is a cookie and if not set up so checkboxes are checked
      session[:ratings] = {"G" => 1, "PG" => 1, "PG-13" => 1, "R" => 1}
    else
      if params.has_key?(:ratings) #set session ratings to params ratings
        session[:ratings] = params[:ratings]
      end
    end
    if !params.has_key?(:ratings) #make sure the params are not empty and set to session
      params[:ratings] = session[:ratings]
    end
    if params.has_key?(:sort_by) #set session order to params order
      session[:order] = params[:sort_by]
    end

    @movies = Movie.find_all_by_rating(session[:ratings].keys, :order => session[:order])
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN (NULL) ORDER BY release_date